results/rest/stage-100/payload-heavy/100VUs/repeat-3/100vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-100/payload-heavy/100VUs/repeat-3/100vus.json)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 364 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 825 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 1304 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 1801 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m04.0s), 100/100 VUs, 2300 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m05.0s), 100/100 VUs, 2788 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m06.0s), 100/100 VUs, 3255 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m07.0s), 100/100 VUs, 3735 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m08.0s), 100/100 VUs, 4212 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m09.0s), 100/100 VUs, 4703 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m10.0s), 100/100 VUs, 5200 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m11.0s), 100/100 VUs, 5694 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m12.0s), 100/100 VUs, 6169 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m13.0s), 100/100 VUs, 6647 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m14.0s), 100/100 VUs, 7124 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m15.0s), 100/100 VUs, 7609 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m16.0s), 100/100 VUs, 8101 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m17.0s), 100/100 VUs, 8597 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m18.0s), 100/100 VUs, 9075 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m19.0s), 100/100 VUs, 9555 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m20.0s), 100/100 VUs, 10033 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m21.0s), 100/100 VUs, 10515 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m22.0s), 100/100 VUs, 11005 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m23.0s), 100/100 VUs, 11500 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m24.0s), 100/100 VUs, 11982 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m25.0s), 100/100 VUs, 12468 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m26.0s), 100/100 VUs, 12950 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m27.0s), 100/100 VUs, 13430 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m28.0s), 100/100 VUs, 13913 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m29.0s), 100/100 VUs, 14405 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m30.0s), 100/100 VUs, 14895 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m31.0s), 100/100 VUs, 15378 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m32.0s), 100/100 VUs, 15868 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m33.0s), 100/100 VUs, 16345 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m33.0s), 100/100 VUs, 16827 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m34.0s), 100/100 VUs, 17310 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m35.0s), 100/100 VUs, 17801 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m36.0s), 100/100 VUs, 18287 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m37.0s), 100/100 VUs, 18774 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m38.0s), 100/100 VUs, 19256 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m39.0s), 100/100 VUs, 19737 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m40.0s), 100/100 VUs, 20220 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m41.0s), 100/100 VUs, 20709 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m42.0s), 100/100 VUs, 21194 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m43.0s), 100/100 VUs, 21684 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m44.0s), 100/100 VUs, 22169 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m45.0s), 100/100 VUs, 22650 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m46.0s), 100/100 VUs, 23134 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m47.0s), 100/100 VUs, 23617 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m48.0s), 100/100 VUs, 24107 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m49.0s), 100/100 VUs, 24589 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m50.0s), 100/100 VUs, 25079 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m51.0s), 100/100 VUs, 25560 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m52.0s), 100/100 VUs, 26044 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m53.0s), 100/100 VUs, 26529 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m54.0s), 100/100 VUs, 27017 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m55.0s), 100/100 VUs, 27499 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m56.0s), 100/100 VUs, 27991 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m57.0s), 100/100 VUs, 28468 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (0m58.0s), 100/100 VUs, 28956 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.00%  0 out of 29058
    benchmark_total_failure_rate...: 0.00%  0 out of 29058

    HTTP
    http_req_duration..............: avg=203.64ms min=60.4µs   med=205.77ms max=403.81ms p(90)=208.5ms  p(95)=209.62ms
      { expected_response:true }...: avg=203.64ms min=60.4µs   med=205.77ms max=403.81ms p(90)=208.5ms  p(95)=209.62ms
    http_req_failed................: 0.00%  0 out of 29058
    http_reqs......................: 29058  498.95277/s

    EXECUTION
    iteration_duration.............: avg=206.79ms min=200.98ms med=206.1ms  max=414.23ms p(90)=208.84ms p(95)=209.96ms
    iterations.....................: 29058  498.95277/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 7.2 MB 124 kB/s
    data_sent......................: 957 MB 16 MB/s



running (0m58.2s), 000/100 VUs, 29058 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s